Services/src/Catalogs/С_ПользователиСервисов/С_ПользователиСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>С_ПользователиСервисов</name>
  <attributes>
    <name>УНП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерОсновнойПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Services/src/Catalogs/С_ПользователиСервисов/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ЗарегистрироватьСервис(Команда)
	
	
	Форма = ПолучитьФорму("РегистрСведений.РегистрацияСервисов.ФормаЗаписи");
	Форма.Запись.ПользовательСервиса = этаформа.ТекущийЭлемент.ТекущиеДанные.Ссылка;
	Форма.Запись.Включен = Истина;
	//Форма.Запись. = ПредопределенноеЗначение("Справочник.ВидыДокументов.ПаспортРФ");//Если, конечно, "ПаспортРФ" - это предопределенный элемент справочника.
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура УНПОтборПриИзменении(Элемент)
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"УНП",
		УНП,
		ВидСравненияКомпоновкиДанных.Содержит,,
		ЗначениеЗаполнено(УНП));

КонецПроцедуры


&НаКлиенте
Процедура РегистрационныйНомерОсновнойПоставкиПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"РегистрационныйНомерОсновнойПоставки",
		РегистрационныйНомерОсновнойПоставки,
		ВидСравненияКомпоновкиДанных.Содержит,,
		ЗначениеЗаполнено(РегистрационныйНомерОсновнойПоставки));

КонецПроцедуры


&НаКлиенте
Процедура НаименованиеОрганизацииПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"НаименованиеОрганизации",
		НаименованиеОрганизации,
		ВидСравненияКомпоновкиДанных.Содержит,,
		ЗначениеЗаполнено(НаименованиеОрганизации));

КонецПроцедуры


&НаКлиенте
Процедура РегистрационныйНомерКонфигурацииПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"РегистрационныйНомерКонфигурации",
		РегистрационныйНомерКонфигурации,
		ВидСравненияКомпоновкиДанных.Содержит,,
		ЗначениеЗаполнено(РегистрационныйНомерКонфигурации));

КонецПроцедуры
